In [1]:
import numpy as np
import pandas as pd
data = {
    "Name": ["Alice_kundu", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
  }
df = pd.DataFrame(data)
print(df)

          Name   Age Department   Salary
0  Alice_kundu  25.0         HR  50000.0
1          Bob  30.0         IT  60000.0
2      Charlie  35.0    Finance  70000.0
3        David   NaN         IT  62000.0
4          Eve  29.0         HR      NaN
5        Alice  25.0         HR  50000.0

In [7]:
data1 = {
    "Department": ["HR", "Finance", "IT"],
    "area" : ["dhaka", "raj", "pabna"]
  }
df2 = pd.DataFrame(data1)
print(df2)

  Department   area
0         HR  dhaka
1    Finance    raj
2         IT  pabna

nowl join

In [ ]:
df3 = pd.merge(df, df2, on = "Department", how= "inner") # as like we are set left, right, outer
print(df3)

          Name   Age Department   Salary   area
0  Alice_kundu  25.0         HR  50000.0  dhaka
1          Bob  30.0         IT  60000.0  pabna
2      Charlie  35.0    Finance  70000.0    raj
3        David   NaN         IT  62000.0  pabna
4          Eve  29.0         HR      NaN  dhaka
5        Alice  25.0         HR  50000.0  dhaka

function .concat

In [11]:
pd.concat([df, df2])

          Name   Age Department   Salary   area
0  Alice_kundu  25.0         HR  50000.0    NaN
1          Bob  30.0         IT  60000.0    NaN
2      Charlie  35.0    Finance  70000.0    NaN
3        David   NaN         IT  62000.0    NaN
4          Eve  29.0         HR      NaN    NaN
5        Alice  25.0         HR  50000.0    NaN
0          NaN   NaN         HR      NaN  dhaka
1          NaN   NaN    Finance      NaN    raj
2          NaN   NaN         IT      NaN  pabna

In [13]:
pd.concat([df, df2], axis=1)

          Name   Age Department   Salary Department   area
0  Alice_kundu  25.0         HR  50000.0         HR  dhaka
1          Bob  30.0         IT  60000.0    Finance    raj
2      Charlie  35.0    Finance  70000.0         IT  pabna
3        David   NaN         IT  62000.0        NaN    NaN
4          Eve  29.0         HR      NaN        NaN    NaN
5        Alice  25.0         HR  50000.0        NaN    NaN